// логические операторы для условия
// && (and,и) выполняется и 1условие и 2 условие одновренно
// || (or,или) выполняется или 1условие или 2 условие одновренно, хотя бы одно из

// ot 0 do 10 ???

if(x>0 && x<10){
    console.log('ot 0 do 10');
}

// женский пол, соверш.
if(isMale==false && age >= 18){}

// 2 четверть часа
if( m >= 15  &&  m<30 ) {}

// юзер зарегестрирован и баланс карты больше sum и
if(isAuth == true && cardBalance >= sum  ) {}

// в базу может добавить запись юзер или админ или модератор
// role
if(role == 'admin' || role == 'moderator') {}


